# Import Pandas Library

In [1]:
import pandas as pd

# Data Structures

## First: Series

In [2]:
lst = [1,2,3,4,5] 
s = pd.Series(lst)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
# change dtype
s = pd.Series(lst, dtype= float)
s

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [4]:
# choose indexes
s = pd.Series(lst, index=['A', 'B', 'C', 'D', 'E' ])
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [5]:
index = [10, 12, 13, 14]
names = ['Nourah', 'Sarah', 'Ahmed', 'Lama']
s2 = pd.Series(names, index=index)
s2

10    Nourah
12     Sarah
13     Ahmed
14      Lama
dtype: object

In [6]:
# use dictionary 
names = {10: 'Nourah', 12: 'Sarah', 13: 'Ahmed', 14: 'Lama'}
s3 = pd.Series(names)
s3

10    Nourah
12     Sarah
13     Ahmed
14      Lama
dtype: object

In [7]:
# change the indexes
s3.index = [10, 20, 30, 40]
s3

10    Nourah
20     Sarah
30     Ahmed
40      Lama
dtype: object

In [8]:
fruit1 = {'Apple': 40 , 'Banana': 50, 'Orange': 60}
ser1 = pd.Series(fruit1)

fruit2 = {'Apple': 30 , 'Strawberry': 20, 'Orange': 20}
ser2 = pd.Series(fruit2)

print(ser1)
print()
print(ser2)
print()
print(ser1 + ser2)

Apple     40
Banana    50
Orange    60
dtype: int64

Apple         30
Strawberry    20
Orange        20
dtype: int64

Apple         70.0
Banana         NaN
Orange        80.0
Strawberry     NaN
dtype: float64

In [9]:
# Selecting
print(s3[20]) # index = 20

Sarah

In [10]:
# Slicing like numpy [start, end(execluded), gap]
# Note that the slice does not use the index labels as references, but the position
s3[:3] # from position 0 to 2

10    Nourah
20     Sarah
30     Ahmed
dtype: object

In [11]:
s3[1:] # from 1 to max

20    Sarah
30    Ahmed
40     Lama
dtype: object

In [12]:
s3[2:4] # from 2 to 3

30    Ahmed
40     Lama
dtype: object

In [13]:
s3[:-1] # from 0 to last item(execluded)

10    Nourah
20     Sarah
30     Ahmed
dtype: object

In [14]:
# Add elements 
s4 = pd.Series({50: 'Ahmed', 60: 'Nada'})
s3 = s3.append(s4)
s3

<ipython-input-14-c4d35d990bd0>:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s3 = s3.append(s4)

10    Nourah
20     Sarah
30     Ahmed
40      Lama
50     Ahmed
60      Nada
dtype: object

In [15]:
# delete an element 
s3.drop(60)

10    Nourah
20     Sarah
30     Ahmed
40      Lama
50     Ahmed
dtype: object

In [16]:
# drop duplicate elements
s3.drop_duplicates()

10    Nourah
20     Sarah
30     Ahmed
40      Lama
60      Nada
dtype: object

In [17]:
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [18]:
s4 = s.copy()
s4

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [19]:
s4 = s4*3
s4

A     3
B     6
C     9
D    12
E    15
dtype: int64

In [20]:
s4.add(s)

A     4
B     8
C    12
D    16
E    20
dtype: int64

In [21]:
s5 = pd.Series({'A': 6, 'B': 8})
s5.add(s)

A     7.0
B    10.0
C     NaN
D     NaN
E     NaN
dtype: float64

In [22]:
s5

A    6
B    8
dtype: int64

In [23]:
s4.sub(s)

A     2
B     4
C     6
D     8
E    10
dtype: int64

In [24]:
s4.mul(s)

A     3
B    12
C    27
D    48
E    75
dtype: int64

In [25]:
s4.div(s)

A    3.0
B    3.0
C    3.0
D    3.0
E    3.0
dtype: float64

## Second: DataFrame

### A- Creating a new DataFrame from the scratch

In [26]:
data = {'year': [2010, 2011, 2012, 2010, 2011, 2012, 2010, 2011, 2012],
        'team': ['FCBarcelona', 'FCBarcelona', 'FCBarcelona', 'RMadrid', 'RMadrid', 'RMadrid', 'ValenciaCF',
                 'ValenciaCF', 'ValenciaCF'],
        'wins':   [30, 28, 32, 29, 32, 26, 21, 17, 19],
        'draws':  [6, 7, 4, 5, 4, 7, 8, 10, 8],
        'losses': [2, 3, 2, 4, 2, 5, 9, 11, 11]}

football = pd.DataFrame(data, columns=['year', 'team', 'wins', 'draws', 'losses'])
football

   year         team  wins  draws  losses
0  2010  FCBarcelona    30      6       2
1  2011  FCBarcelona    28      7       3
2  2012  FCBarcelona    32      4       2
3  2010      RMadrid    29      5       4
4  2011      RMadrid    32      4       2
5  2012      RMadrid    26      7       5
6  2010   ValenciaCF    21      8       9
7  2011   ValenciaCF    17     10      11
8  2012   ValenciaCF    19      8      11

### B- Reading tabular data

In [27]:
edu = pd.read_csv('/Users/Noura/Downloads/educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [28]:
# you can also put educ_figdp_1_Data.csv on anacond floder and read the file without need to identify the path
edu = pd.read_csv('educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [29]:
edu.dtypes

TIME                   int64
GEO                   object
INDIC_ED              object
Value                 object
Flag and Footnotes    object
dtype: object

In [30]:
# na_values >> Additional strings to recognize as NA/NaN. 
# usecols >> Return a subset of the columns.
# Pandas uses the special value NaN (not a number) to represent missing values.
edu = pd.read_csv('/Users/Noura/Downloads/educ_figdp_1_Data.csv', na_values=':', usecols=['TIME', 'GEO', 'Value'])
edu

     TIME                            GEO  Value
0    2000  European Union (28 countries)    NaN
1    2001  European Union (28 countries)    NaN
2    2002  European Union (28 countries)   5.00
3    2003  European Union (28 countries)   5.03
4    2004  European Union (28 countries)   4.95
..    ...                            ...    ...
379  2007                        Finland   5.90
380  2008                        Finland   6.10
381  2009                        Finland   6.81
382  2010                        Finland   6.85
383  2011                        Finland   6.76

[384 rows x 3 columns]

In [31]:
edu.dtypes

TIME       int64
GEO       object
Value    float64
dtype: object

# Viewing Data

In [32]:
edu.head() #first rows that are listed

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

In [33]:
edu.head(3)

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)    5.0

In [34]:
edu.tail() #last rows that are listed

     TIME      GEO  Value
379  2007  Finland   5.90
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

In [35]:
edu.columns

Index(['TIME', 'GEO', 'Value'], dtype='object')

In [36]:
edu.columns[0]

'TIME'

In [37]:
edu.index

RangeIndex(start=0, stop=384, step=1)

In [38]:
edu.values # values of any DataFrame can be retrieved as a Python array by calling its values attribute.

array([[2000, 'European Union (28 countries)', nan],
       [2001, 'European Union (28 countries)', nan],
       [2002, 'European Union (28 countries)', 5.0],
       ...,
       [2009, 'Finland', 6.81],
       [2010, 'Finland', 6.85],
       [2011, 'Finland', 6.76]], dtype=object)

In [39]:
# quick statistical information
edu.describe()

              TIME       Value
count   384.000000  361.000000
mean   2005.500000    5.203989
std       3.456556    1.021694
min    2000.000000    2.880000
25%    2002.750000    4.620000
50%    2005.500000    5.060000
75%    2008.250000    5.660000
max    2011.000000    8.810000

In [40]:
edu.T

,0,1,2,3,4,5,6,7,8,9,...,374,375,376,377,378,379,380,381,382,383
TIME,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,...,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011
GEO,European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),...,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland
Value,NaN,NaN,5.0,5.03,4.95,4.92,4.91,4.92,5.04,5.38,...,6.22,6.43,6.42,6.3,6.18,5.9,6.1,6.81,6.85,6.76

# Selection

In [41]:
edu['Value'] # The result will be a Series data structure, not a DataFrame, because only one column is retrieved.

0       NaN
1       NaN
2      5.00
3      5.03
4      4.95
       ...
379    5.90
380    6.10
381    6.81
382    6.85
383    6.76
Name: Value, Length: 384, dtype: float64

In [42]:
edu[['Value','GEO']]

     Value                            GEO
0      NaN  European Union (28 countries)
1      NaN  European Union (28 countries)
2     5.00  European Union (28 countries)
3     5.03  European Union (28 countries)
4     4.95  European Union (28 countries)
..     ...                            ...
379   5.90                        Finland
380   6.10                        Finland
381   6.81                        Finland
382   6.85                        Finland
383   6.76                        Finland

[384 rows x 2 columns]

In [43]:
edu[10:14] # select a subset of rows from a DataFrame

    TIME                            GEO  Value
10  2010  European Union (28 countries)   5.41
11  2011  European Union (28 countries)   5.25
12  2000  European Union (27 countries)   4.91
13  2001  European Union (27 countries)   4.99

In [44]:
edu.loc[90:94, ['TIME', 'GEO']]  #[rows, columns]

    TIME      GEO
90  2006  Belgium
91  2007  Belgium
92  2008  Belgium
93  2009  Belgium
94  2010  Belgium

In [45]:
edu.loc[90:94,:] #[rows, columns=all]

    TIME      GEO  Value
90  2006  Belgium   5.98
91  2007  Belgium   6.00
92  2008  Belgium   6.43
93  2009  Belgium   6.57
94  2010  Belgium   6.58

In [46]:
edu.sample(10,random_state=23) # random sample >> 23 seed for random number generator.
# seed makes the random numbers predictable

     TIME                       GEO  Value
294  2006               Netherlands   5.50
343  2007                   Romania   4.25
178  2010                    Greece    NaN
73   2001  Euro area (13 countries)   4.97
284  2008                     Malta   5.72
193  2001                    France   5.95
236  2008                    Latvia   5.71
205  2001                     Italy   4.83
59   2011  Euro area (17 countries)   5.15
252  2000                Luxembourg    NaN

In [47]:
edu.sample(10,random_state=23).loc[73:59,:]

     TIME                       GEO  Value
73   2001  Euro area (13 countries)   4.97
284  2008                     Malta   5.72
193  2001                    France   5.95
236  2008                    Latvia   5.71
205  2001                     Italy   4.83
59   2011  Euro area (17 countries)   5.15

# Filtering Data

In [48]:
# Another way of selection
# by applying Boolean indexing. This indexing is commonly known as a filter. 
edu[edu['Value'] > 6.5].tail()

     TIME      GEO  Value
286  2010    Malta   6.74
287  2011    Malta   7.96
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

# Filtering Missing Values

In [49]:
edu[edu['Value'].isnull()].head()

    TIME                            GEO  Value
0   2000  European Union (28 countries)    NaN
1   2001  European Union (28 countries)    NaN
36  2000       Euro area (18 countries)    NaN
37  2001       Euro area (18 countries)    NaN
48  2000       Euro area (17 countries)    NaN

# Manipulating Data

In [50]:
# aggregation functions
edu.max(axis=0) # 0 means applied to the rows for each column

TIME      2011
GEO      Spain
Value     8.81
dtype: object

In [51]:
edu['TIME'].max()

2011

In [52]:
print('Pandas max function:', edu['Value'].max())
print('Python max function:', max(edu['Value']))

Pandas max function: 8.81
Python max function: nan

In [53]:
edu['Value'].head()

0     NaN
1     NaN
2    5.00
3    5.03
4    4.95
Name: Value, dtype: float64

In [54]:
s = edu['Value'] / 100
s.head()

0       NaN
1       NaN
2    0.0500
3    0.0503
4    0.0495
Name: Value, dtype: float64

In [55]:
import numpy as np

In [56]:
# we can apply any function to a DataFrame or Series
s = edu['Value'].apply(np.sqrt) # sqrt function from the numpy library
s.head()

0         NaN
1         NaN
2    2.236068
3    2.242766
4    2.224860
Name: Value, dtype: float64

In [57]:
def f2(x):
    return x**2
s = edu['Value'].apply(f2)
s.head()

0        NaN
1        NaN
2    25.0000
3    25.3009
4    24.5025
Name: Value, dtype: float64

In [58]:
edu

     TIME                            GEO  Value
0    2000  European Union (28 countries)    NaN
1    2001  European Union (28 countries)    NaN
2    2002  European Union (28 countries)   5.00
3    2003  European Union (28 countries)   5.03
4    2004  European Union (28 countries)   4.95
..    ...                            ...    ...
379  2007                        Finland   5.90
380  2008                        Finland   6.10
381  2009                        Finland   6.81
382  2010                        Finland   6.85
383  2011                        Finland   6.76

[384 rows x 3 columns]

In [59]:
s = edu['Value'].apply(lambda d: d**2)
s.head()

0        NaN
1        NaN
2    25.0000
3    25.3009
4    24.5025
Name: Value, dtype: float64

In [60]:
# add a new column to a DataFrame
edu['ValueNorm'] = edu['Value'] / edu['Value'].max()
edu.tail()

     TIME      GEO  Value  ValueNorm
379  2007  Finland   5.90   0.669694
380  2008  Finland   6.10   0.692395
381  2009  Finland   6.81   0.772985
382  2010  Finland   6.85   0.777526
383  2011  Finland   6.76   0.767310

In [61]:
edu

     TIME                            GEO  Value  ValueNorm
0    2000  European Union (28 countries)    NaN        NaN
1    2001  European Union (28 countries)    NaN        NaN
2    2002  European Union (28 countries)   5.00   0.567537
3    2003  European Union (28 countries)   5.03   0.570942
4    2004  European Union (28 countries)   4.95   0.561862
..    ...                            ...    ...        ...
379  2007                        Finland   5.90   0.669694
380  2008                        Finland   6.10   0.692395
381  2009                        Finland   6.81   0.772985
382  2010                        Finland   6.85   0.777526
383  2011                        Finland   6.76   0.767310

[384 rows x 4 columns]

In [62]:
# remove this column from the DataFrame
# rows(axis=0), columns(axis=1) 
# inplace = False (default), inplace=True (change original DataFrame)
edu.drop('ValueNorm', axis=1, inplace=True)
edu.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

In [63]:
# insert a new row
# ignore_index=True, otherwise the index 0
edu = edu.append({'TIME': 2000, 'Value': 5.00, 'GEO': 'a'}, ignore_index=True)
edu.tail()

<ipython-input-63-34698bd17bd1>:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  edu = edu.append({'TIME': 2000, 'Value': 5.00, 'GEO': 'a'}, ignore_index=True)

     TIME      GEO  Value
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76
384  2000        a   5.00

In [64]:
# remove row(axis=0)
# inplace = False (default), inplace=True (change original DataFrame)
edu.drop(max(edu.index), axis=0, inplace=True)
edu.tail()

     TIME      GEO  Value
379  2007  Finland   5.90
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

In [65]:
# to clear data frame
edu.drop(edu.index, inplace=False)

Empty DataFrame
Columns: [TIME, GEO, Value]
Index: []

In [66]:
teams = {'year': [2010, 2011, 2012],
        'team': ['FCBarcelona','RMadrid','ValenciaCF']}

football2 = pd.DataFrame(teams, columns = ['year', 'team', 'wins'])
football2

   year         team wins
0  2010  FCBarcelona  NaN
1  2011      RMadrid  NaN
2  2012   ValenciaCF  NaN

In [67]:
football2['wins'][0] = 12
football2

<ipython-input-67-1eb975534344>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  football2['wins'][0] = 12

   year         team wins
0  2010  FCBarcelona   12
1  2011      RMadrid  NaN
2  2012   ValenciaCF  NaN

In [68]:
# how = all : if all values are NA, drop that label
football2Drop = football2.dropna(how='all', subset=['wins'], axis=0)
football2Drop.head()

   year         team wins
0  2010  FCBarcelona   12

In [69]:
# how = any : if any NA values are present, drop that label
football2Drop = football2.dropna(how='any', subset=['wins'], axis=0)
football2Drop.head()

   year         team wins
0  2010  FCBarcelona   12

In [70]:
 edu.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

In [71]:
eduFilled = edu.fillna(value={'Value': 0})
eduFilled.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)   0.00
1  2001  European Union (28 countries)   0.00
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

# Sorting

In [72]:
edu.sort_values(by='Value', ascending=False, inplace=True)
edu.head()

     TIME      GEO  Value
130  2010  Denmark   8.81
131  2011  Denmark   8.75
129  2009  Denmark   8.74
121  2001  Denmark   8.44
122  2002  Denmark   8.44

In [73]:
# to return to the original order, we can sort by an index using the sort_index and axis=0
edu.sort_index(axis=0, ascending=True, inplace=True)
edu.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

# Grouping Data

In [74]:
# like group by in sql
group = edu[['GEO', 'Value']].groupby('GEO').mean()
group.head()

                   Value
GEO
Austria         5.618333
Belgium         6.189091
Bulgaria        4.093333
Cyprus          7.023333
Czech Republic  4.168333